EDT/УТ/src/Catalogs/ТарифныеПланы/ТарифныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТарифныеПланы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВторойУровень</name>
      <description>Второй уровень</description>
    </items>
    <items>
      <name>ПервыйУровень</name>
      <description>Первый уровень</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипТарифа</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторТарификации</name>
    <type>
      <types>CatalogRef.новаКлассификаторРайонов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеБрейки</name>
    <attributes>
      <name>РасчетныйБрейк</name>
      <type>
        <types>CatalogRef.РасчетныеБрейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеЗоныТарификации</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ГруппыРайонов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ТарификацияФинансовыхУслуг/ТарификацияФинансовыхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарификацияФинансовыхУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПроцентКассовогоОбслуживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентАгентскогоВознаграждения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.ТарифныеПланы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ТарифныеПланы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущиеТарифы.Параметры.УстановитьЗначениеПараметра("Тариф", Объект.Ссылка);
	//ТолькоПросмотр = Истина;
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТарификацияФинансовыхУслугСрезПоследних.ПроцентБанковскойКомиссии,
	            |	ТарификацияФинансовыхУслугСрезПоследних.ПроцентАгентскогоВознаграждения
	            |ИЗ
	            |	РегистрСведений.ТарификацияФинансовыхУслуг.СрезПоследних КАК ТарификацияФинансовыхУслугСрезПоследних
	            |ГДЕ
	            |	ТарификацияФинансовыхУслугСрезПоследних.Тариф = &Тариф";
	Зап.УстановитьПараметр("Тариф", Объект.Ссылка);
	
	Рез = Зап.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ПроцентБанковскойКомиссии = Рез.ПроцентБанковскойКомиссии;
		ПроцентАгентскогоВознаграждения = Рез.ПроцентАгентскогоВознаграждения;
	КонецеСли;	
КонецПроцедуры
